// 1. Переписать пример с итерацией числа и прерыванием цикла с помощью while и do/while
// 2. (Периписать самостоятельно) Скрипт о запросе на угадывние сгенерированного числа так, чтобы человек мог отменить игру, либо угадать, пока не станет соотвествовать
// 3. Запросить у пользователя значение, кратное которому будут выводиться числа - вывести их в консоль
// 3.1 (Усложняем) Кроме кратного запросить количество числе, которые следует вывести
// Все задания написать с помощью while и for циклов

var amount = 5,
    count = 0;

do {
    console.log('I want to live');
    //count++;
} while (++count < amount); // 5
